# YOLOv8L-P2 Face Detection Model
# Optimized for small face detection with P2/4 stride detection head
# Based on ultralytics yolov8-p2.yaml with face-specific tuning

# Parameters
nc: 1  # number of classes (face only)
scales:
  # Using 'l' (large) scale for best accuracy
  # [depth, width, max_channels]
  l: [1.00, 1.00, 512]

# YOLOv8.0 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4 (crucial for tiny faces)
  - [-1, 3, C2f, [128, True]]       # 2
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 6, C2f, [256, True]]       # 4
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16
  - [-1, 6, C2f, [512, True]]       # 6
  - [-1, 1, Conv, [1024, 3, 2]]     # 7-P5/32
  - [-1, 3, C2f, [1024, True]]      # 8
  - [-1, 1, SPPF, [1024, 5]]        # 9

# YOLOv8.0-p2 head with 4 detection scales
# P2/4 enables detection of faces as small as 4x4 pixels at 1024px input
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]       # cat backbone P4
  - [-1, 3, C2f, [512]]             # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]       # cat backbone P3
  - [-1, 3, C2f, [256]]             # 15 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]       # cat backbone P2
  - [-1, 3, C2f, [128]]             # 18 (P2/4-xsmall) <- KEY for tiny faces

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]      # cat head P3
  - [-1, 3, C2f, [256]]             # 21 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]      # cat head P4
  - [-1, 3, C2f, [512]]             # 24 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]       # cat head P5
  - [-1, 3, C2f, [1024]]            # 27 (P5/32-large)

  - [[18, 21, 24, 27], 1, Detect, [nc]]  # Detect(P2, P3, P4, P5)
