# YOLOv8m-Face-P2: Medium model with P2 detection head
# For fair SOTA comparison against YOLOv8m-Face (84.7% Hard mAP)
#
# Goal: Beat 84.7% with same model size but better architecture (P2 head)

nc: 1  # face only

# YOLOv8m scale factors
depth_multiple: 0.67  # YOLOv8m depth
width_multiple: 0.75  # YOLOv8m width

# Backbone (CSPDarknet - same as standard YOLOv8)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 3, C2f, [128, True]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 6, C2f, [256, True]]      # 4
  - [-1, 1, Conv, [512, 3, 2]]     # 5-P4/16
  - [-1, 6, C2f, [512, True]]      # 6
  - [-1, 1, Conv, [512, 3, 2]]     # 7-P5/32
  - [-1, 3, C2f, [512, True]]      # 8
  - [-1, 1, SPPF, [512, 5]]        # 9

# Head with P2 for tiny faces
head:
  - [-1, 1, nn.Upsample, [null, 2, "nearest"]]  # 10
  - [[-1, 6], 1, Concat, [1]]                   # 11 cat P4
  - [-1, 3, C2f, [512]]                         # 12

  - [-1, 1, nn.Upsample, [null, 2, "nearest"]]  # 13
  - [[-1, 4], 1, Concat, [1]]                   # 14 cat P3
  - [-1, 3, C2f, [256]]                         # 15 (P3/8-small)

  - [-1, 1, nn.Upsample, [null, 2, "nearest"]]  # 16 - NEW: Upsample to P2
  - [[-1, 2], 1, Concat, [1]]                   # 17 - NEW: cat P2
  - [-1, 3, C2f, [128]]                         # 18 - NEW: P2/4-xsmall

  - [-1, 1, Conv, [128, 3, 2]]                  # 19 - Downsample
  - [[-1, 15], 1, Concat, [1]]                  # 20 cat P3
  - [-1, 3, C2f, [256]]                         # 21 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                  # 22 - Downsample
  - [[-1, 12], 1, Concat, [1]]                  # 23 cat P4
  - [-1, 3, C2f, [512]]                         # 24 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 25 - Downsample
  - [[-1, 9], 1, Concat, [1]]                   # 26 cat P5
  - [-1, 3, C2f, [512]]                         # 27 (P5/32-large)

  - [[18, 21, 24, 27], 1, Detect, [nc]]         # 28 - Detect 4 scales
